{
    "architectures": ["DFlashDraftModel"],
    "model_type": "dflash",
    "hidden_size": 3584,
    "intermediate_size": 18944,
    "num_hidden_layers": 1,
    "num_attention_heads": 28,
    "num_key_value_heads": 4,
    "vocab_size": 152064,
    "rms_norm_eps": 1e-6,
    "max_position_embeddings": 32768,
    "rope_theta": 1000000.0,
    "num_target_layers": 5,
    "target_hidden_size": 3584,
    "target_num_hidden_layers": 28,
    "target_layer_ids": null,
    "mask_token_id": 151669,
    "tie_word_embeddings": false
}
